Autodesk.Revit.DB.GroupType.GetAvailableAttachedDetailGroupTypeIds
Returns the attached detail groups available for this element group type.
Returns:
Returns the collection of attached detail group Ids that match this group's type.
Since:
2019.1

Autodesk.Revit.DB.GroupType.Groups
Retrieve a set of all the groups that have this type.
Returns: A set of group objects that all share this group type.
Remarks: All groups returned by this property belong to this group type. A groups type can be
changed by using the GroupType property on the group object, in which case it will no longer
belong to this type but it will belong to the new type instead.

Autodesk.Revit.DB.GroupType
An element representing a group of elements that may be placed many times in a project or family.
Remarks:
Grouping elements is useful when you need to create entities that represent repeating layouts
or are common to many building projects, such as hotel rooms, apartments, or repeating floors.